fixture/charges/charge_without_customer.json

[
  {
    "request": {
      "body": "{\"amount\":258,\"customer\":{\"creation_date\":null,\"email\":\"hello@company.com\",\"external_id\":\"default-9.668317\",\"id\":null,\"last_name\":\"platform\",\"name\":\"adm\",\"phone_number\":null,\"requires_account\":false},\"description\":\"An awesome package you bought\",\"due_date\":null,\"method\":\"store\",\"order_id\":null}",
      "headers": {
        "Authorization": "Basic c2tfZGEwNWRjOTg2MDVkNGUxZDg4MDU4MmI0ZWU2MjFlODQ6",
        "Content-Type": "application/json",
        "Accept": "application/json; Charset=utf-8"
      },
      "method": "post",
      "options": {
        "ssl_options": {
          "versions": [
            "tlsv1.2"
          ]
        },
        "recv_timeout": 10000
      },
      "request_body": "",
      "url": "https://sandbox-api.openpay.mx/v1/mjtkrswiqtxftemz4tgl/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"id\":\"trn3snoaw6tie1t11cvk\",\"authorization\":null,\"operation_type\":\"in\",\"transaction_type\":\"charge\",\"status\":\"in_progress\",\"conciliated\":false,\"creation_date\":\"2020-03-09T22:53:10-06:00\",\"operation_date\":\"2020-03-09T22:53:10-06:00\",\"description\":\"An awesome package you bought\",\"error_message\":null,\"order_id\":null,\"currency\":\"MXN\",\"amount\":258.00,\"customer\":{\"name\":\"adm\",\"last_name\":\"platform\",\"email\":\"hello@company.com\",\"phone_number\":null,\"address\":null,\"creation_date\":\"2020-03-09T22:53:10-06:00\",\"external_id\":\"default-9.668317\",\"clabe\":null},\"payment_method\":{\"type\":\"store\",\"reference\":\"1010103099601647\",\"barcode_url\":\"https://sandbox-api.openpay.mx/barcode/1010103099601647?width=1&height=45&text=false\"},\"method\":\"store\"}",
      "headers": {
        "Date": "Tue, 10 Mar 2020 04:53:11 GMT",
        "Content-Type": "application/json;charset=utf-8",
        "Content-Length": "733",
        "Connection": "keep-alive",
        "Server": "Apache-Coyote/1.1",
        "OpenPay-Request-ID": "fec97fee-aa27-42ca-909d-fcecbecab586",
        "Cache-Control": "no-cache, no-store, max-age=0, must-revalidate",
        "Pragma": "no-cache",
        "Expires": "0",
        "Strict-Transport-Security": "max-age=31536000 ; includeSubDomains",
        "X-XSS-Protection": "1; mode=block",
        "X-Frame-Options": "DENY",
        "X-Content-Type-Options": "nosniff",
        "Resource-ID": "trn3snoaw6tie1t11cvk",
        "Location": "https://sandbox-api.openpay.mx/v1/mjtkrswiqtxftemz4tgl/charges/trn3snoaw6tie1t11cvk",
        "Vary": "Accept-Encoding"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]